#Python - Non-technical introduction

##Day 3 Session 2: "Play with the Pros: How to use SQL for data wrangling?"

This file accompanies the lectures and provides the code for the corresponding slides.

*Note:* If you want to make changes to this document, you need to save your own copy using the "Save copy in Drive" command in the "File" menu.

###Preparation

**Make sure to run the follwing code before continuing.** Code will prepare everything (load data, ...).

In [ ]:
#load the sqlite3 package
import sqlite3
#load the numpy package
import numpy as np
#load the Pandas package
import pandas as pd


#Get the database file form Github and store it in the local working directory
!wget https://raw.githubusercontent.com/bachmannpatrick/Python-Class/master/data/database.sqlite

#Read the csv file and store it in the variable "myData". Note: this file is hostes in a GitHub repository.
myData=pd.read_csv(filepath_or_buffer="https://raw.githubusercontent.com/bachmannpatrick/Python-Class/master/data/transactions.csv", sep=",")
#Adjust the format of column "TransDate" to datetime
myData["TransDate"]  = pd.to_datetime(myData["TransDate"], dayfirst=True)

--2021-09-01 06:01:29--  https://raw.githubusercontent.com/bachmannpatrick/Python-Class/master/data/database.sqlite
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.108.133, 185.199.109.133, 185.199.110.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.108.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 34689024 (33M) [application/octet-stream]
Saving to: ‘database.sqlite’

database.sqlite     100%[===================>]  33.08M   162MB/s    in 0.2s

2021-09-01 06:01:30 (162 MB/s) - ‘database.sqlite’ saved [34689024/34689024]

###27 - Connection to a database

####**Slide:** The sqlite3 module for working with SQLite databases

In [ ]:
import sqlite3

####**Slide:** DB step 1: Open connection

In [ ]:
con = sqlite3.connect(database="database.sqlite")
cursor = con.cursor()

####**Slide:** DB step 2:
Check which tables are in the database

In [ ]:
cursor.execute("SELECT name FROM sqlite_master;")
cursor.fetchall()

[('transactions',), ('demographics',)]

####**Slide:** DB step 2:
 Get a table from the database

In [ ]:
pd.read_sql_query("SELECT * from transactions", con)

        Customer         TransDate  Quantity  ...    Cost    TransID  TransKey
0         149332  2005-11-15 00:00         1  ...  107.00  127998739    100000
1         172951  2008-08-29 00:00         1  ...  108.00  128888288    100001
2         120621  2007-10-19 00:00         1  ...   49.00  125375247    100002
3         149236  2005-11-14 00:00         1  ...   18.95  127996226    100003
4         149236  2007-06-12 00:00         1  ...   35.00  128670302    100004
...          ...               ...       ...  ...     ...        ...       ...
223186    199997  2012-09-17 00:00         1  ...   13.80  132481149    323186
223187    199997  2012-09-17 00:00         1  ...   13.80  132481149    323187
223188    199998  2012-09-17 00:00         1  ...   13.80  132481154    323188
223189    199999  2012-09-17 00:00         1  ...  109.99  132481165    323189
223190    199542  2012-09-17 00:00         1  ...   10.50  131973368    323190

[223191 rows x 7 columns]

####**Slide:** DB step 2:
Create a new table in the database

In [ ]:
myData.to_sql(con=con, name="new_table")

####**Slide:** DB step 2:
Remove a table from the database

In [ ]:
cursor.execute("DROP TABLE new_table")
con.commit() #make sure to commit your commands to the server!

####**Slide:** DB step 3:
Close connection to free resources

In [ ]:
con.close()

###28 - Database and the role of SQL

####**Slide:** A general introduction to SQL:
How to connect to a database

In [ ]:
con = sqlite3.connect(database="database.sqlite")
cursor= = con.cursor()

####**Slide:** A general introduction to SQL:
How to execute SQL queries in Python

In [ ]:
pd.read_sql_query("SELECT * FROM transactions;", con)

####**Slide:** DB step 3:
Close connection to free resources

In [ ]:
con.close()